tap "anomalyco/tap"
tap "charmbracelet/tap"
tap "deskflow/tap"
tap "felixkratz/formulae"
tap "homebrew/bundle"
tap "homebrew/services"
tap "nikitabobko/tap"
tap "steipete/tap"
tap "surge-downloader/tap"
# Container runtimes on MacOS (and Linux) with minimal setup
brew "colima"
# Apjanke's fork of the classic cowsay project
brew "cowsay"
# Pack, ship and run any application as a lightweight container
brew "docker"
# Command-line DNS Client for Humans
brew "doggo"
# Utility for exporting data from Ente and decrypt the export from Ente Auth
brew "ente-cli"
# Like neofetch, but much faster because written mostly in C
brew "fastfetch"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Play, record, convert, and stream select audio and video codecs
brew "ffmpeg"
# Tool to convert a Wallpaper's color scheme / palette
brew "gowall"
# Mac App Store command-line interface
brew "mas"
# Deep clean and optimize your Mac
brew "mole"
# Port scanning utility for large networks
brew "nmap"
# Manage multiple Node.js versions
brew "nvm"
# Command-line tool to view objects (JSON/YAML/TOML) in TUI tree widget
brew "otree"
# Terminal slideshow tool
brew "presenterm"
# Prints a steam locomotive if you type sl instead of ls
brew "sl"
# Cross-platform application to monitor your network traffic
brew "sniffnet"
# Modern and pretty fancy file manager for the terminal
brew "superfile"
# TUI to view and query tabular files (CSV,TSV, Parquet, etc.)
brew "tabiew"
# General purpose fuzzy finder TUI
brew "television"
# Simple terminal image viewer written in Rust
brew "viu"
# Library to create, extract, and modify Windows Imaging files
brew "wimlib"
# The AI coding agent built for the terminal.
brew "anomalyco/tap/opencode"
# A powerful terminal-based AI assistant for developers, providing intelligent coding assistance directly in your terminal.
brew "charmbracelet/tap/crush"
# A window border system for macOS
brew "felixkratz/formulae/borders"
# Grep the GIF. Stick the landing
brew "steipete/tap/gifgrep"
# Privacy-focused app for managing your finances
cask "actual"
# AeroSpace is an i3-like tiling window manager for macOS
cask "nikitabobko/tap/aerospace"
# AirPods companion app
cask "airbuddy"
# Menu bar tool to limit maximum charging percentage
cask "aldente"
# Enable Windows-like alt-tab
cask "alt-tab"
# Application uninstaller
cask "appcleaner"
# Tool to flash OS images to SD cards & USB drives
cask "balenaetcher"
# 3D model slicing software for 3D printers, maintained by Bambu Lab
cask "bambu-studio"
# Graphical configurator for Dygma Raise keyboards
cask "bazecor"
# Utility improving 3rd party mouse performance and functionalities
cask "bettermouse"
# OpenAI's official ChatGPT desktop app
cask "chatgpt"
# Anthropic's official Claude AI desktop app
cask "claude"
# Terminal-based AI coding assistant
cask "claude-code"
# Screen capturing tool
cask "cleanshot"
# OpenAI's coding agent that runs in your terminal
cask "codex"
# Server and cloud storage browser
cask "cyberduck"
# Convert potentially dangerous PDFs or Office documents into safe PDFs
cask "dangerzone"
# Virtual monitor for screen sharing
cask "deskpad"
# Downloads videos from different websites
cask "downie"
# Productivity app
cask "dropzone"
# Matrix collaboration client
cask "element"
# Desktop client for Ente Photos
cask "ente"
# Desktop client for Ente Auth
cask "ente-auth"
# Per-application volume mixer, equalizer, and audio router
cask "finetune"
cask "font-jetbrains-mono-nerd-font"
cask "font-meslo-lg-nerd-font"
cask "font-monaspice-nerd-font"
cask "font-roboto-mono-nerd-font"
# Terminal emulator that uses platform-native UI and GPU acceleration
cask "ghostty"
# Free and open-source image editor
cask "gimp"
# Keyboard shortcuts for every button on your screen
cask "homerow"
# Free and open-source media player
cask "iina"
# Menu bar manager
cask "jordanbaird-ice"
# Keyboard customiser
cask "karabiner-elements"
# Open-source keystroke visualiser
cask "keycastr"
# Custom Discord client
cask "legcord"
# Open-source cross-platform alternative to AirDrop
cask "localsend"
# Tool to control external monitor brightness & volume
cask "monitorcontrol"
# VPN client
cask "mullvad-vpn"
# Free and open-source RSS reader
cask "netnewswire"
# Knowledge base that works on top of a local folder of plain text Markdown files
cask "obsidian"
# Get up and running with large language models locally
cask "ollama-app"
# Verify system files structure, run miscellaneous maintenance and more
cask "onyx"
# AI coding agent desktop client
cask "opencode-desktop"
# WebKit based web browser
cask "orion"
# Client for Proton Drive
cask "proton-drive"
# Client for Proton Mail and Proton Calendar
cask "proton-mail"
# Bridges Proton Mail to email clients supporting IMAP and SMTP protocols
cask "proton-mail-bridge"
# Desktop client for Proton Pass
cask "proton-pass"
# VPN client focusing on security
cask "protonvpn"
# Control your tools with a few keystrokes
cask "raycast"
# Open source virtual/remote desktop application
cask "rustdesk"
# Instant messaging application focusing on security
cask "signal"
# System monitor for the menu bar
cask "stats"
# Blazing fast TUI download manager built in Go for power users
cask "surge-downloader/tap/surge"
# Real time file synchronisation software
cask "syncthing-app"
# Mesh VPN based on WireGuard
cask "tailscale-app"
# Customizable email client
cask "thunderbird"
# Web browser focusing on security
cask "tor-browser"
# Open-source BitTorrent client
cask "transmission"
# Virtual machines UI using QEMU
cask "utm"
# Wine wrapper built with SwiftUI
cask "whisky"
# Multiplayer code editor
cask "zed"
# Gecko based web browser
cask "zen"
mas "Affinity Designer 2", id: 1616831348
mas "Affinity Photo 2", id: 1616822987
mas "Affinity Publisher 2", id: 1606941598
mas "Calcbot", id: 931657367
mas "Dark Reader for Safari", id: 1438243180
mas "ExcalidrawZ", id: 6636493997
mas "Final Cut Pro", id: 424389933
mas "Folder Preview", id: 6698876601
mas "Infuse", id: 1136220934
mas "Ivory", id: 6444602274
mas "Keka", id: 470158793
mas "Keynote", id: 409183694
mas "Markdown Preview", id: 6739955340
mas "Numbers", id: 361304891
mas "Pages", id: 409201541
mas "Pages", id: 361309726
mas "Paperparrot", id: 1663665267
mas "Paste", id: 967805235
mas "Pixelmator Pro", id: 1289583905
mas "Prime Video", id: 545519333
mas "Proton Pass for Safari", id: 6502835663
mas "Telegram", id: 747648890
mas "Termix", id: 6752672071
mas "Xcode", id: 497799835
