tap "ameshkov/tap"
tap "homebrew/bundle"
tap "homebrew/services"
tap "jesseduffield/lazygit"
tap "librespeed/tap"
tap "zen-browser/browser", "https://github.com/zen-browser/desktop.git"
# Performance-portable, length-agnostic SIMD with runtime dispatch
brew "highway"
# General-purpose data compression with high compression ratio
brew "xz"
# New file format for still image compression
brew "jpeg-xl"
# Codec library for encoding and decoding AV1 video streams
brew "aom"
# ARP scanning and fingerprinting tool
brew "arp-scan"
# Automatic configure script builder
brew "autoconf"
# Collection of over 500 reusable autoconf macros
brew "autoconf-archive"
# Tool for generating GNU Standards-compliant Makefiles
brew "automake"
# Parser generator
brew "bison"
# Mozilla CA certificate store
brew "ca-certificates"
# GNU internationalization (i18n) and localization (l10n) library
brew "gettext"
# Cryptography and SSL/TLS Toolkit
brew "openssl@3"
# Library for command-line editing
brew "readline"
# Command-line interface for SQLite
brew "sqlite"
# Interpreted, interactive, object-oriented programming language
brew "python@3.12"
# Decentralized dependency manager for Cocoa
brew "carthage"
# HTTP/2 C Library
brew "libnghttp2"
# Validating, recursive, caching DNS resolver
brew "unbound"
# Parser generator tool and incremental parsing library
brew "tree-sitter"
# Emacs dependency management
brew "cask"
# Object-file caching compiler wrapper
brew "ccache"
# Ruby environment tool
brew "chruby"
# Cross-platform make
brew "cmake"
# AV1 decoder targeted to be small and fast
brew "dav1d"
# Command-line tool to interact with exercism.io
brew "exercism"
# Perl lib for reading and writing EXIF metadata
brew "exiftool"
# Like neofetch, but much faster because written mostly in C
brew "fastfetch"
# C/C++ and Java libraries for Unicode and globalization
brew "icu4c@76"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# Create thumbnails for your video files
brew "ffmpegthumbnailer"
# GNU database manager
brew "gdbm"
# Directory/file & DNS busting tool written in Go
brew "gobuster"
# Update of iperf: measures TCP, UDP, and SCTP bandwidth
brew "iperf3"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Portable Foreign Function Interface library
brew "libffi"
# C library of Git core methods that is re-entrant and linkable
brew "libgit2"
# YAML Parser
brew "libyaml"
# Next-gen compiler infrastructure
brew "llvm@17"
# Just-In-Time Compiler (JIT) for the Lua programming language
brew "luajit"
# Keep your Mac's application settings in sync
brew "mackup"
# Mac App Store command-line interface
brew "mas"
# 'traceroute' and 'ping' in a single tool
brew "mtr"
# Netwide Assembler (NASM) is an 80x86 assembler
brew "nasm"
# Small build system for use with gyp or CMake
brew "ninja"
# Command-line tool to view objects (JSON/YAML/TOML) in TUI tree widget
brew "otree"
# Package compiler and linker metadata toolkit
brew "pkgconf"
# PNG image optimizing utility
brew "pngquant"
# PDF rendering library (based on the xpdf-3.0 code base)
brew "poppler"
# Theme for zsh
brew "powerlevel10k"
# Install Ruby, JRuby, Rubinius, TruffleRuby, or mruby
brew "ruby-install"
# Rust toolchain installer
brew "rustup"
# Prints a steam locomotive if you type sl instead of ls
brew "sl"
# Command-line interface for https://speedtest.net bandwidth tests
brew "speedtest-cli"
# Formatting tool for reformatting Swift code
brew "swiftformat"
# Swift code generator for assets, storyboards, Localizable.strings, etc.
brew "swiftgen"
# TUI to view and query tabular files (CSV,TSV, Parquet, etc.)
brew "tabiew"
# General purpose fuzzy finder TUI
brew "television"
# Official tldr client written in Rust
brew "tlrc"
# Command-line unarchiving tools supporting multiple formats
brew "unar"
# Feature-rich command-line audio/video downloader
brew "yt-dlp"
# Command-line client for LibreSpeed
brew "librespeed/tap/librespeed-cli"
# Password manager that keeps all passwords secure behind one password
cask "1password"
# Command-line interface for 1Password
cask "1password-cli"
# AirPods companion app
cask "airbuddy"
# Menu bar tool to limit maximum charging percentage
cask "aldente"
# Enable Windows-like alt-tab
cask "alt-tab"
# Application uninstaller
cask "appcleaner"
# Multi-track audio editor and recorder
cask "audacity"
# 3D model slicing software for 3D printers, maintained by Bambu Lab
cask "bambu-studio"
# Menu bar icon organiser
cask "bartender"
# Utility improving 3rd party mouse performance and functionalities
cask "bettermouse"
# Web browser focusing on privacy
cask "brave-browser"
# OpenAI's official ChatGPT desktop app
cask "chatgpt"
# Tool to remove unnecessary files and folders from disk
cask "cleanmymac"
# Screen capturing tool
cask "cleanshot"
# Server and cloud storage browser
cask "cyberduck"
# Voice and text chat software
cask "discord"
# App to build and share containerised applications and microservices
cask "docker"
# Downloads videos from different websites
cask "downie"
# Productivity app
cask "dropzone"
# Desktop client for Ente Photos
cask "ente"
# Desktop client for Ente Auth
cask "ente-auth"
# Web browser
cask "firefox"
cask "font-jetbrains-mono-nerd-font"
cask "font-meslo-lg-nerd-font"
cask "font-monaspace-nerd-font"
cask "font-roboto-mono-nerd-font"
# Terminal emulator that uses platform-native UI and GPU acceleration
cask "ghostty"
# Xcode extension for GitHub Copilot
cask "github-copilot-for-xcode"
# Tools to protect your emails and files
cask "gpg-suite"
# Open Source Multimedia Framework
cask "gstreamer-runtime"
# Open-source video transcoder
cask "handbrake"
# Automated organisation
cask "hazel"
# Keyboard shortcuts for every button on your screen
cask "homerow"
# Free and open-source media player
cask "iina"
# Menu bar manager
cask "jordanbaird-ice"
# Keyboard customiser
cask "karabiner-elements"
# Use Vim in input fields and non input fields
cask "kindavim"
# Provides updates to various Microsoft products
cask "microsoft-auto-update"
# Multi-platform web browser
cask "microsoft-edge"
# Tool to control external monitor brightness & volume
cask "monitorcontrol"
# VPN client
cask "mullvadvpn"
# Privacy-focused note taking app
cask "notesnook"
# Open-source software for live streaming and screen recording
cask "obs"
# Knowledge base that works on top of a local folder of plain text Markdown files
cask "obsidian"
# WebKit based web browser
cask "orion"
# Converts and edits video, audio or image files
cask "permute"
# Client for Proton Drive
cask "proton-drive"
# Client for Proton Mail and Proton Calendar
cask "proton-mail"
# Desktop client for Proton Pass
cask "proton-pass"
# VPN client focusing on security
cask "protonvpn"
# HTTP debugging proxy
cask "proxyman"
# Peer to peer Bitorrent client
cask "qbittorrent"
# Control your tools with a few keystrokes
cask "raycast"
# Tool that provides consistent, highly configurable symbols for apps
cask "sf-symbols"
# Instant messaging application focusing on security
cask "signal"
# Team communication and collaboration software
cask "slack"
# Music streaming service
cask "spotify"
# Free, open-source, and completely encrypted notes app
cask "standard-notes"
# System monitor for the menu bar
cask "stats"
# Mesh VPN based on WireGuard
cask "tailscale"
# Messaging app with a focus on speed and security
cask "telegram"
# Disposable email client
cask "tempbox"
# Web browser focusing on security
cask "tor-browser"
# Git client focusing on power and productivity
cask "tower"
# Virtual machines UI using QEMU
cask "utm"
# Open-source code editor
cask "visual-studio-code"
# Multimedia player
cask "vlc"
# Create, manage, and run virtual machines
cask "vmware-fusion"
# Terminal emulator
cask "wave"
# Compatibility layer to run Windows applications
cask "wine-stable"
# Network protocol analyzer
cask "wireshark"
# Install and switch between multiple versions of Xcode
cask "xcodes"
# Multiplayer code editor
cask "zed"
# Gecko based web browser
cask "zen-browser"
# Video communication and virtual meeting platform
cask "zoom"
mas "1Password for Safari", id: 1569813296
mas "A Companion for SwiftUI", id: 1485436674
mas "Accelerate", id: 1459809092
mas "AdBlock", id: 1402042596
mas "AdGuard Home", id: 1543143740
mas "Affinity Designer 2", id: 1616831348
mas "Affinity Photo 2", id: 1616822987
mas "Affinity Publisher 2", id: 1606941598
mas "Amphetamine", id: 937984704
mas "Apple Configurator", id: 1037126344
mas "Boom 3D", id: 1233048948
mas "CARROT Weather", id: 993487541
mas "Compressor", id: 424390742
mas "CrystalFetch", id: 6454431289
mas "Cubox", id: 1113361350
mas "Cubox for Safari", id: 1550721541
mas "Dark Reader for Safari", id: 1438243180
mas "Developer", id: 640199958
mas "Ducky", id: 1525505933
mas "ExcalidrawZ", id: 6636493997
mas "Final Cut Pro", id: 424389933
mas "Folder Tidy", id: 486626129
mas "Gifox", id: 1461845568
mas "Gifski", id: 1351639930
mas "GlanceCam", id: 1360797896
mas "Hush", id: 1544743900
mas "Ice Cubes", id: 6444915884
mas "Infuse", id: 1136220934
mas "JSONPeep", id: 1458969831
mas "Kagi for Safari", id: 1622835804
mas "Keka", id: 470158793
mas "Keynote", id: 409183694
mas "Mactracker", id: 430255202
mas "Messenger", id: 1480068668
mas "Microsoft Outlook", id: 985367838
mas "Motion", id: 434290957
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Pixelmator Pro", id: 1289583905
mas "Prime Video", id: 545519333
mas "Proton Pass for Safari", id: 6502835663
mas "QR Capture", id: 1369524274
mas "Refined GitHub", id: 1519867270
mas "Shapr3D", id: 1091675654
mas "TestFlight", id: 899247664
mas "Transmit", id: 1436522307
mas "Xcode", id: 497799835
