tap "enigmaticdb/super-secret-tap"
tap "homebrew/bundle"
brew "highway"
brew "xz"
brew "jpeg-xl"
brew "ca-certificates"
brew "openssl@3"
brew "libgit2"
brew "bat"
brew "bison"
brew "gettext"
brew "readline"
brew "python@3.12"
brew "libnghttp2"
brew "tree-sitter"
brew "cask"
brew "chruby"
brew "eza"
brew "ffmpeg"
brew "gdbm"
brew "gh"
brew "gifski"
brew "git"
brew "libffi"
brew "libyaml"
brew "mackup"
brew "mas"
brew "neovim"
brew "pngquant"
brew "powerlevel10k"
brew "ruby-install"
brew "sl"
brew "speedtest-cli"
cask "1password"
cask "1password-cli"
cask "airbuddy"
cask "aldente"
cask "alt-tab"
cask "appcleaner"
cask "arc"
cask "audacity"
cask "bartender"
cask "cleanmymac"
cask "cleanshot"
cask "cork"
cask "discord"
cask "downie"
cask "dropzone"
cask "ente"
cask "firefox"
cask "handbrake"
cask "hazel"
cask "iina"
cask "karabiner-elements"
cask "keyclu"
cask "logi-options-plus"
cask "monitorcontrol"
cask "obsidian"
cask "onyx"
cask "permute"
cask "pictogram"
cask "proxyman"
cask "raycast"
cask "sf-symbols"
cask "skype"
cask "slack"
cask "spotify"
cask "stats"
cask "telegram"
cask "tempbox"
cask "tower"
cask "transmission"
cask "visual-studio-code"
cask "vlc"
cask "warp"
cask "xcodes"
cask "zed"
mas "1Password for Safari", id: 1569813296
mas "A Companion for SwiftUI", id: 1485436674
mas "Accelerate", id: 1459809092
mas "AdBlock", id: 1402042596
mas "Amphetamine", id: 937984704
mas "Bakery", id: 1575220747
mas "Bluebird", id: 1478757472
mas "Boom 3D", id: 1233048948
mas "Calcbot", id: 931657367
mas "Canva", id: 897446215
mas "CARROT Weather", id: 993487541
mas "CloudMounter", id: 1130254674
mas "Compressor", id: 424390742
mas "Cubox", id: 1113361350
mas "Cubox for Safari", id: 1550721541
mas "Dark Reader for Safari", id: 1438243180
mas "Developer", id: 640199958
mas "DuckDuckGo Privacy for Safari", id: 1482920575
mas "Ducky", id: 1525505933
mas "Final Cut Pro", id: 424389933
mas "Folder Tidy", id: 486626129
mas "GarageBand", id: 682658836
mas "Gifox", id: 1461845568
mas "Gifski", id: 1351639930
mas "GlanceCam", id: 1360797896
mas "Hush", id: 1544743900
mas "Ice Cubes", id: 6444915884
mas "JSONPeep", id: 1458969831
mas "Keka", id: 470158793
mas "Keynote", id: 409183694
mas "Mactracker", id: 430255202
mas "Messenger", id: 1480068668
mas "Microsoft Outlook", id: 985367838
mas "Motion", id: 434290957
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "PayPal Honey", id: 1472777122
mas "Petrify", id: 1451177988
mas "Pixelmator Pro", id: 1289583905
mas "Prime Video", id: 545519333
mas "QR Capture", id: 1369524274
mas "Refined GitHub", id: 1519867270
mas "SVGShaper", id: 1566140414
mas "Taio", id: 1527036273
mas "TestFlight", id: 899247664
mas "Tot", id: 1491071483
mas "Transmit", id: 1436522307
mas "Unsqueeze", id: 6475134617
mas "Wallaroo", id: 1630565980
mas "Xcode", id: 497799835
vscode "akamud.vscode-theme-onedark"
vscode "catppuccin.catppuccin-vsc"
vscode "davidbwaters.macos-modern-theme"
vscode "esbenp.prettier-vscode"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "liviuschera.noctis"
vscode "mechatroner.rainbow-csv"
vscode "oderwat.indent-rainbow"
vscode "pkief.material-icon-theme"
vscode "shd101wyy.markdown-preview-enhanced"
vscode "streetsidesoftware.code-spell-checker"
vscode "syler.sass-indented"
vscode "tonka3000.raycast"
vscode "yzhang.markdown-all-in-one"
