tap "ameshkov/tap"
tap "homebrew/bundle"
tap "homebrew/services"
tap "jesseduffield/lazygit"
tap "librespeed/tap"
tap "zen-browser/browser", "https://github.com/zen-browser/desktop.git"
# Performance-portable, length-agnostic SIMD with runtime dispatch
brew "highway"
# General-purpose data compression with high compression ratio
brew "xz"
# New file format for still image compression
brew "jpeg-xl"
# Codec library for encoding and decoding AV1 video streams
brew "aom"
# ARP scanning and fingerprinting tool
brew "arp-scan"
# Mozilla CA certificate store
brew "ca-certificates"
# Cryptography and SSL/TLS Toolkit
brew "openssl@3"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Parser generator
brew "bison"
# Resource monitor. C++ version and continuation of bashtop and bpytop
brew "btop"
# GNU internationalization (i18n) and localization (l10n) library
brew "gettext"
# Library for command-line editing
brew "readline"
# Command-line interface for SQLite
brew "sqlite"
# Interpreted, interactive, object-oriented programming language
brew "python@3.12"
# Decentralized dependency manager for Cocoa
brew "carthage"
# HTTP/2 C Library
brew "libnghttp2"
# Validating, recursive, caching DNS resolver
brew "unbound"
# Parser generator tool and incremental parsing library
brew "tree-sitter"
# Emacs dependency management
brew "cask"
# Ruby environment tool
brew "chruby"
# AV1 decoder targeted to be small and fast
brew "dav1d"
# Tool for managing dock items
brew "dockutil"
# Command-line tool to interact with exercism.io
brew "exercism"
# Perl lib for reading and writing EXIF metadata
brew "exiftool"
# C library of Git core methods that is re-entrant and linkable
brew "libgit2"
# Modern, maintained replacement for ls
brew "eza"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# Create thumbnails for your video files
brew "ffmpegthumbnailer"
# Command-line fuzzy finder written in Go
brew "fzf"
# GNU database manager
brew "gdbm"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# Render markdown on the CLI
brew "glow"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Directory/file & DNS busting tool written in Go
brew "gobuster"
# Update of iperf: measures TCP, UDP, and SCTP bandwidth
brew "iperf3"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Portable Foreign Function Interface library
brew "libffi"
# YAML Parser
brew "libyaml"
# Next-gen compiler infrastructure
brew "llvm@17"
# Powerful, lightweight programming language
brew "lua"
# Just-In-Time Compiler (JIT) for the Lua programming language
brew "luajit"
# Package manager for the Lua programming language
brew "luarocks"
# Keep your Mac's application settings in sync
brew "mackup"
# Mac App Store command-line interface
brew "mas"
# 'traceroute' and 'ping' in a single tool
brew "mtr"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Port scanning utility for large networks
brew "nmap"
# PNG image optimizing utility
brew "pngquant"
# PDF rendering library (based on the xpdf-3.0 code base)
brew "poppler"
# Theme for zsh
brew "powerlevel10k"
# Install Ruby, JRuby, Rubinius, TruffleRuby, or mruby
brew "ruby-install"
# Rust toolchain installer
brew "rustup"
# Prints a steam locomotive if you type sl instead of ls
brew "sl"
# Command-line interface for https://speedtest.net bandwidth tests
brew "speedtest-cli"
# Formatting tool for reformatting Swift code
brew "swiftformat"
# Swift code generator for assets, storyboards, Localizable.strings, etc.
brew "swiftgen"
# Programmatically correct mistyped console commands
brew "thefuck"
# Command-line unarchiving tools supporting multiple formats
brew "unar"
# Blazing fast terminal file manager written in Rust, based on async I/O
brew "yazi"
# Feature-rich command-line audio/video downloader
brew "yt-dlp"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# Fish-like fast/unobtrusive autosuggestions for zsh
brew "zsh-autosuggestions"
# Fish shell like syntax highlighting for zsh
brew "zsh-syntax-highlighting"
# A simple terminal UI for git commands, written in Go
brew "jesseduffield/lazygit/lazygit"
# Command-line client for LibreSpeed
brew "librespeed/tap/librespeed-cli"
# Password manager that keeps all passwords secure behind one password
cask "1password"
# Command-line interface for 1Password
cask "1password-cli"
# AirPods companion app
cask "airbuddy"
# Menu bar tool to limit maximum charging percentage
cask "aldente"
# Enable Windows-like alt-tab
cask "alt-tab"
# Application uninstaller
cask "appcleaner"
# Chromium based browser
cask "arc"
# Multi-track audio editor and recorder
cask "audacity"
# Menu bar icon organiser
cask "bartender"
# Utility improving 3rd party mouse performance and functionalities
cask "bettermouse"
# Web browser focusing on privacy
cask "brave-browser"
# OpenAI's official ChatGPT desktop app
cask "chatgpt"
# Tool to remove unnecessary files and folders from disk
cask "cleanmymac"
# Screen capturing tool
cask "cleanshot"
# Server and cloud storage browser
cask "cyberduck"
# Voice and text chat software
cask "discord"
# App to build and share containerised applications and microservices
cask "docker"
# Downloads videos from different websites
cask "downie"
# Productivity app
cask "dropzone"
# Desktop client for Ente Photos
cask "ente"
# Desktop client for Ente Auth
cask "ente-auth"
# Web browser
cask "firefox"
cask "font-jetbrains-mono-nerd-font"
cask "font-meslo-lg-nerd-font"
cask "font-monaspace-nerd-font"
cask "font-roboto-mono-nerd-font"
# Tools to protect your emails and files
cask "gpg-suite"
# Open Source Multimedia Framework
cask "gstreamer-runtime"
# Open-source video transcoder
cask "handbrake"
# Automated organisation
cask "hazel"
# Free and open-source media player
cask "iina"
# Menu bar manager
cask "jordanbaird-ice"
# Keyboard customiser
cask "karabiner-elements"
# GPU-based terminal emulator
cask "kitty"
# App to manage software development and track bugs
cask "linear-linear"
# Provides updates to various Microsoft products
cask "microsoft-auto-update"
# Tool to control external monitor brightness & volume
cask "monitorcontrol"
# VPN client
cask "mullvadvpn"
# Open-source software for live streaming and screen recording
cask "obs"
# Knowledge base that works on top of a local folder of plain text Markdown files
cask "obsidian"
# WebKit based web browser
cask "orion"
# Converts and edits video, audio or image files
cask "permute"
# Client for Proton Drive
cask "proton-drive"
# Client for Proton Mail and Proton Calendar
cask "proton-mail"
# Desktop client for Proton Pass
cask "proton-pass"
# VPN client focusing on security
cask "protonvpn"
# HTTP debugging proxy
cask "proxyman"
# Peer to peer Bitorrent client
cask "qbittorrent"
# Control your tools with a few keystrokes
cask "raycast"
# Tool that provides consistent, highly configurable symbols for apps
cask "sf-symbols"
# Instant messaging application focusing on security
cask "signal"
# Team communication and collaboration software
cask "slack"
# Music streaming service
cask "spotify"
# Free, open-source, and completely encrypted notes app
cask "standard-notes"
# System monitor for the menu bar
cask "stats"
# Mesh VPN based on WireGuard
cask "tailscale"
# Messaging app with a focus on speed and security
cask "telegram"
# Disposable email client
cask "tempbox"
# Web browser focusing on security
cask "tor-browser"
# Git client focusing on power and productivity
cask "tower"
# Virtual machines UI using QEMU
cask "utm"
# Open-source code editor
cask "visual-studio-code"
# Multimedia player
cask "vlc"
# Create, manage, and run virtual machines
cask "vmware-fusion"
# Terminal emulator
cask "wave"
# GPU-accelerated cross-platform terminal emulator and multiplexer
cask "wezterm"
# Compatibility layer to run Windows applications
cask "wine-stable"
# Network protocol analyzer
cask "wireshark"
# Install and switch between multiple versions of Xcode
cask "xcodes"
# Multiplayer code editor
cask "zed"
# Gecko based web browser
cask "zen-browser"
# Video communication and virtual meeting platform
cask "zoom"
mas "1Password for Safari", id: 1569813296
mas "A Companion for SwiftUI", id: 1485436674
mas "Accelerate", id: 1459809092
mas "AdBlock", id: 1402042596
mas "AdGuard Home", id: 1543143740
mas "Affinity Designer 2", id: 1616831348
mas "Affinity Photo 2", id: 1616822987
mas "Affinity Publisher 2", id: 1606941598
mas "Amphetamine", id: 937984704
mas "Apple Configurator", id: 1037126344
mas "Bakery", id: 1575220747
mas "Bluebird", id: 1478757472
mas "Boom 3D", id: 1233048948
mas "Calcbot", id: 931657367
mas "CARROT Weather", id: 993487541
mas "Compressor", id: 424390742
mas "CrystalFetch", id: 6454431289
mas "Cubox", id: 1113361350
mas "Cubox for Safari", id: 1550721541
mas "Dark Reader for Safari", id: 1438243180
mas "Developer", id: 640199958
mas "DuckDuckGo Privacy for Safari", id: 1482920575
mas "Ducky", id: 1525505933
mas "Final Cut Pro", id: 424389933
mas "Folder Tidy", id: 486626129
mas "Gifox", id: 1461845568
mas "Gifski", id: 1351639930
mas "GlanceCam", id: 1360797896
mas "Hush", id: 1544743900
mas "Ice Cubes", id: 6444915884
mas "Infuse", id: 1136220934
mas "JSONPeep", id: 1458969831
mas "Keka", id: 470158793
mas "Keynote", id: 409183694
mas "Mactracker", id: 430255202
mas "Messenger", id: 1480068668
mas "Microsoft Outlook", id: 985367838
mas "Motion", id: 434290957
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "PayPal Honey", id: 1472777122
mas "Pixelmator Pro", id: 1289583905
mas "Prime Video", id: 545519333
mas "Proton Pass for Safari", id: 6502835663
mas "QR Capture", id: 1369524274
mas "Refined GitHub", id: 1519867270
mas "SVGShaper", id: 1566140414
mas "Taio", id: 1527036273
mas "TestFlight", id: 899247664
mas "Transmit", id: 1436522307
mas "Unsqueeze", id: 6475134617
mas "Xcode", id: 497799835
vscode "1yib.rust-bundle"
vscode "akamud.vscode-theme-onedark"
vscode "bierner.markdown-preview-github-styles"
vscode "catppuccin.catppuccin-vsc"
vscode "catppuccin.catppuccin-vsc-icons"
vscode "dustypomerleau.rust-syntax"
vscode "eamodio.gitlens"
vscode "esbenp.prettier-vscode"
vscode "ginfuru.ginfuru-vscode-jekyll-syntax"
vscode "golang.go"
vscode "matthewpi.caddyfile-support"
vscode "mechatroner.rainbow-csv"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.vscode-remote-extensionpack"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-server"
vscode "oderwat.indent-rainbow"
vscode "rust-lang.rust-analyzer"
vscode "serayuzgur.crates"
vscode "shd101wyy.markdown-preview-enhanced"
vscode "sswg.swift-lang"
vscode "streetsidesoftware.code-spell-checker"
vscode "sumneko.lua"
vscode "syler.sass-indented"
vscode "tamasfe.even-better-toml"
vscode "tonka3000.raycast"
vscode "vadimcn.vscode-lldb"
vscode "yzhang.markdown-all-in-one"
