tap "enigmaticdb/super-secret-tap"
tap "homebrew/bundle"
brew "highway"
brew "xz"
brew "jpeg-xl"
brew "ca-certificates"
brew "openssl@3"
brew "libgit2"
brew "bat"
brew "bison"
brew "gettext"
brew "readline"
brew "python@3.12"
brew "libnghttp2"
brew "tree-sitter"
brew "cask"
brew "chruby"
brew "eza"
brew "ffmpeg"
brew "gdbm"
brew "gh"
brew "gifski"
brew "git"
brew "libffi"
brew "libyaml"
brew "mackup"
brew "mas"
brew "neovim"
brew "pngquant"
brew "powerlevel10k"
brew "ruby-install"
brew "sl"
brew "speedtest-cli"
cask "1password"
cask "1password-cli"
cask "airbuddy"
cask "aldente"
cask "alt-tab"
cask "appcleaner"
cask "arc"
cask "audacity"
cask "bartender"
cask "cleanmymac"
cask "cleanshot"
cask "cork"
cask "discord"
cask "downie"
cask "dropzone"
cask "ente"
cask "firefox"
cask "handbrake"
cask "hazel"
cask "iina"
cask "karabiner-elements"
cask "keyclu"
cask "logi-options-plus"
cask "monitorcontrol"
cask "obsidian"
cask "onyx"
cask "permute"
cask "pictogram"
cask "proxyman"
cask "raycast"
cask "sf-symbols"
cask "skype"
cask "slack"
cask "spotify"
cask "stats"
cask "telegram"
cask "tempbox"
cask "tower"
cask "transmission"
cask "visual-studio-code"
cask "vlc"
cask "warp"
cask "xcodes"
cask "zed"
vscode "akamud.vscode-theme-onedark"
vscode "catppuccin.catppuccin-vsc"
vscode "davidbwaters.macos-modern-theme"
vscode "esbenp.prettier-vscode"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "liviuschera.noctis"
vscode "mechatroner.rainbow-csv"
vscode "oderwat.indent-rainbow"
vscode "pkief.material-icon-theme"
vscode "shd101wyy.markdown-preview-enhanced"
vscode "streetsidesoftware.code-spell-checker"
vscode "syler.sass-indented"
vscode "tonka3000.raycast"
vscode "yzhang.markdown-all-in-one"
